STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_SerialPort_Client/STM32_BLE/App/app_ble.c
    result = aci_gap_start_procedure(GAP_GENERAL_DISCOVERY_PROC, LE_1M_PHY_BIT, 0, 0);
    
    if (result == BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("** START GENERAL DISCOVERY (SCAN) **\n");
    }
    else
    {
      BSP_LED_On(LED_RED);
      APP_DBG_MSG("-- aci_gap_start_procedure, Failed 0x%02X\n", result);
    }
  }
  BLEStack_Process_Schedule();

  return;
}

static void Central_security_request(void)
{
  tBleStatus status;
  status = aci_gap_set_security(bleAppContext.BleApplicationContext_legacy.connectionHandle, GAP_SECURITY_LEVEL_2, 0x00);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Pairing request cmd failure: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("Pairing request cmd success\n");
  }
  BLEStack_Process_Schedule();
}

static void Central_conn_interv_update(void)
{
  tBleStatus status;
  uint32_t paramA, paramB, paramC, paramD, paramE, paramF;
  paramC = 0x0000;
  paramD = 0x01F4;

  if (bleAppContext.connIntervalFlag != 0)
  {
    bleAppContext.connIntervalFlag = 0;
    paramA = CONN_INT_MS(11.25);
    paramB = CONN_INT_MS(11.25);
    paramE = 0x00;
    paramF = CONN_CE_LENGTH_MS(11.25);
  }
  else
  {
    bleAppContext.connIntervalFlag = 1;
    paramA = CONN_INT_MS(26.25);
    paramB = CONN_INT_MS(26.25);
    paramE = 0x00;
    paramF = CONN_CE_LENGTH_MS(26.25);
  }
    
  status = aci_gap_start_connection_update(bleAppContext.BleApplicationContext_legacy.connectionHandle,
                                           paramA,
                                           paramB,
                                           paramC,
                                           paramD,
                                           paramE,
                                           paramF);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gap_start_connection_update() Failed, status 0x%02X\n",status);
  }
  else
  {
    APP_DBG_MSG("aci_gap_start_connection_update(), Successfully\n");
  }
  BLEStack_Process_Schedule();
}

#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    UTIL_SEQ_SetTask(1<<CFG_TASK_START_SCAN_ID, CFG_SEQ_PRIO_0);
  }

  return;
}

void APPE_Button2Action(void)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    ret = aci_gap_clear_security_db();
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Success\n");
    }
  }
  else
  {
    APP_DBG_MSG("**SECURITY REQ \n");
    UTIL_SEQ_SetTask(1 << CFG_TASK_CENTRAL_SECURITY_REQ_ID, CFG_SEQ_PRIO_0);
  }
  
  return;
}

void APPE_Button3Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
  }
  else
  {
    APP_DBG_MSG("**CONN INTERVAL TOGGLE\n");
    UTIL_SEQ_SetTask(1 << CFG_TASK_CENTRAL_CONN_INTERV_UPDATE_ID, CFG_SEQ_PRIO_0);
  }
  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
